Ruby/AMPTA/app/views/projects/all.html.erb


			<% if p.user_id == current_user.id && p.users.include?(current_user) %>
---
SELECT "users".* FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = 17 AND "users"."id" = ? LIMIT 1  [["id", :id]]
SELECT 1 AS one FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = 16 AND "users"."id" = 3 LIMIT 1