Ruby/AMPTA/app/views/projects/new.html.erb

<% @user = User.all %>
---
SELECT "users".* FROM "users"