Ruby/AMPTA/app/views/tickets/new.html.erb

<% @status = Status.all %>
---
SELECT "statuses".* FROM "statuses"