Ruby/AMPTA/app/controllers/create_project_controller.rb

SELECT "users".* FROM "users"
---
  def new
  	@user = User.all

INSERT INTO "projects" ("created_at", "description", "end_date", "name", "start_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@project = Project.new(params[:project])
    @project.user_id = current_user.id

    # chosen_userids.each do |c|
    #   @project.users << params[c.chosen_userids]
    # end

  	if @project.save