Ruby/AMPTA/app/controllers/projects_controller.rb

	def show
		if !current_user
			redirect_to log_in_path
		end
		@project = Project.find_by_id(params[:id])
		@owner = User.find(@project.user_id)
		@members = Project.find_by_id(params[:id]).users
		@tickets = Ticket.where(:project_id => @project)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
SELECT "users".* FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = 1
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" IN (SELECT "projects"."id" FROM "projects" WHERE "projects"."user_id" = 1)

	def all
		if !current_user
			redirect_to log_in_path
		end
		@projects = Project.all
---
SELECT "projects".* FROM "projects"

	def new
		if !current_user
			redirect_to log_in_path
		end
			@user = User.all
---
SELECT "users".* FROM "users"

	def create
		if !current_user
			redirect_to log_in_path
		end
			# New Project object with params sent from view
			@project = Project.new(params[:project])

			@users = params[:chosen_userids]

			# Set the owner of the project to the creator
			@project.user_id = current_user.id

			# Add to relational table projects_users
			@users.each_with_index  do |data, index|
			  	@project.users << User.find(@users[index])
---
INSERT INTO "projects" ("created_at", "description", "end_date", "name", "start_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]