Ruby/AMPTA/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'oskar@local.se' LIMIT 1
---
  def create
  	user = User.authenticate params[:email], params[:password]

  	if user
  		session[:user_id] = user.id
  		redirect_to projects_path, :notice => "Welcome back," + user.first_name + "!"