Ruby/AMPTA/app/controllers/tickets_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IS NULL LIMIT 1
SELECT "statuses".* FROM "statuses"
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def new

    @project = Project.find_by_id(params[:project_id])
    @ticket = Ticket.new
    @status = Status.all
    @members = Project.find_by_id(params[:project_id]).users

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "tickets" ("created_at", "description", "name", "project_id", "status_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create

  	@project = Project.find(params[:project_id])
  	@ticket = Ticket.new(params[:ticket])

  	if @ticket.save